results/saturate_ssd/cockroachdb/cockroachdb_maxthroughput_disk_swapon_results/exp6_trial_3.txt
Adding shard node URL: jdbc:postgresql://10.0.0.15:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.15:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.15:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
[...]
Still waiting for thread Thread-180 to complete. Workload status: true
Still waiting for thread Thread-160 to complete. Workload status: true
[OVERALL], RunTime(ms), 339137
[OVERALL], Throughput(ops/sec), 34.9976558146118
[TOTAL_GCS_Copy], Count, 11
[TOTAL_GC_TIME_Copy], Time(ms), 77
[TOTAL_GC_TIME_%_Copy], Time(%), 0.0227046886656425
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 77
[TOTAL_GC_TIME_%], Time(%), 0.0227046886656425
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 75.2109375
[CLEANUP], MinLatency(us), 32
[CLEANUP], MaxLatency(us), 368
[CLEANUP], 99thPercentileLatency(us), 225
[CLEANUP], 99.9PercentileLatency(us), 368
[UPDATE], Operations, 11869
[UPDATE], AverageLatency(us), 7146652.713960738
[UPDATE], MinLatency(us), 6480
[UPDATE], MaxLatency(us), 293076991
[UPDATE], 99thPercentileLatency(us), 110690303
[UPDATE], 99.9PercentileLatency(us), 163839999
[UPDATE], Return=OK, 11869