results/saturate_ssd/cockroachdb/cockroachdb_maxthroughput_disk_swapon_results/exp6_trial_5.txt
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.16:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 340154
[OVERALL], Throughput(ops/sec), 22.698542424901664
[TOTAL_GCS_Copy], Count, 12
[TOTAL_GC_TIME_Copy], Time(ms), 91
[TOTAL_GC_TIME_%_Copy], Time(%), 0.02675258853342898
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 91
[TOTAL_GC_TIME_%], Time(%), 0.02675258853342898
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 106.3515625
[CLEANUP], MinLatency(us), 43
[CLEANUP], MaxLatency(us), 1253
[CLEANUP], 99thPercentileLatency(us), 268
[CLEANUP], 99.9PercentileLatency(us), 1253
[UPDATE], Operations, 7721
[UPDATE], AverageLatency(us), 1.1101224637223158E7
[UPDATE], MinLatency(us), 74368
[UPDATE], MaxLatency(us), 337903615
[UPDATE], 99thPercentileLatency(us), 301465599
[UPDATE], 99.9PercentileLatency(us), 333185023
[UPDATE], Return=OK, 7721