results/saturate_ssd/cockroachdb/cockroachdb_maxthroughput_disk_swapon_results/exp6_trial_5.txt
Adding shard node URL: jdbc:postgresql://10.0.0.28:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.28:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.28:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
Still waiting for thread Thread-179 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 323047
[OVERALL], Throughput(ops/sec), 73.45370797438143
[TOTAL_GCS_Copy], Count, 12
[TOTAL_GC_TIME_Copy], Time(ms), 84
[TOTAL_GC_TIME_%_Copy], Time(%), 0.026002408318294243
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 84
[TOTAL_GC_TIME_%], Time(%), 0.026002408318294243
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 93.30859375
[CLEANUP], MinLatency(us), 37
[CLEANUP], MaxLatency(us), 355
[CLEANUP], 99thPercentileLatency(us), 184
[CLEANUP], 99.9PercentileLatency(us), 355
[UPDATE], Operations, 23729
[UPDATE], AverageLatency(us), 3422834.4212145475
[UPDATE], MinLatency(us), 3384
[UPDATE], MaxLatency(us), 301465599
[UPDATE], 99thPercentileLatency(us), 27951103
[UPDATE], 99.9PercentileLatency(us), 269221887
[UPDATE], Return=OK, 23729